app/controllers/listings_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" IN (1, 2, 3, 4, 5, 6)
SELECT "properties".* FROM "properties" WHERE "properties"."id" IN (1, 2, 3, 4, 5, 6)
---
    scope = Listing.published
                   .joins(:property)
                   .includes(:photos, property: :neighborhood)

SELECT "amenities".* FROM "amenities" WHERE "amenities"."id" IN (1, 3, 8)
SELECT "listings".* FROM "listings" WHERE "listings"."id" = 9 LIMIT 1
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = 6
SELECT "reviews".* FROM "reviews" INNER JOIN "visits" ON "reviews"."visit_id" = "visits"."id" INNER JOIN "applications" ON "visits"."application_id" = "applications"."id" INNER JOIN "listings" ON "applications"."listing_id" = "listings"."id" WHERE "listings"."property_id" = 1
SELECT "visits".* FROM "visits" WHERE "visits"."id" = 1
SELECT "properties".* FROM "properties" WHERE "properties"."id" = 6
---
  def show
    @listing = Listing.includes(:photos, property: [:neighborhood, :amenities, :host])
                      .find(params[:id])
    @property = @listing.property
    @reviews = @property.reviews.includes(:visit)