app/controllers/pages_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" IN (1, 2)
SELECT "neighborhoods".* FROM "neighborhoods" ORDER BY "neighborhoods"."name" ASC
---
  def home
    @featured_listings = Listing.published
                                .includes(:photos, property: :neighborhood)
                                .order(available_on: :asc)
                                .limit(3)
    @neighborhoods = Neighborhood.order(:name)